import './App.css'
import { Header } from './components/Header.tsx'
import { Footer } from './components/Footer.tsx'
import { DateSelector } from './components/DateSelector.tsx'
import ErrorBoundary from './components/ErrorBoundary.tsx'
import { TasksProvider } from './context/TaskContext.tsx'
import { TaskStatsProvider } from './context/TaskStatsContext.tsx'

function App() {
  return (
    <TasksProvider>
      <TaskStatsProvider>
        <ErrorBoundary>
          <div className="bg-sky-800 App flex flex-col min-h-screen w-full p-4 rounded-md animate-bgPulse">
            <Header className="bg-sky-800" />
            <div className="flex-grow bg-sky-800">
              <DateSelector />
            </div>
            <Footer className="bg-sky-800" />
          </div>
        </ErrorBoundary>
      </TaskStatsProvider>
    </TasksProvider >
  )
}

export default App

// Хедер:
// Лого, меню юзерів, пошук задач, лічильник скільки задач було зроблено і скільки ще треба (під цим є полоска, яка заповнюється від виконання задач), зміна кольору сайту

// Боді:
// Береться цей місяць, розбивається на тижні. Кожен тиждень пишеться в ряд під місяцем і роком. Тобто йде під хедером місяць (при натисканні на нього з'являться вибір місяця) через кому, рік (при натисканні можна вибрати рік), під цим, 5 блоків (якщо 5 тижнів) з написом "тиждень 1". Який зараз тиждень, сайт сам розуміє і активує теперішній тиждень, але можна клацати на будь який тиждень. При активації тижня, з'являються дні, кожен день і тиждень показує скільки відсотків задач було виконано. День теж обирається автоматично, але можна перейти на інший. При активації дня, з'являються години, полоса годин і хвилин, на якій окремим кольором, який можна обрати, помічені задачі, якщо задача виконана, помічається зеленим кольором (зелений колір зарезервований) і галочкою, також ця задача йде у відсотки. Час не можна обрати один і той самий, тільки 1 задача, на 1 час. Зверху лист всіх задач, знизу цих задач є колір цієї задачі, в кінці є кнопка, додати задачу. Там пишеться опис, назва, час і можна обрати колір. При натисканні на існуючу задачу, обирається в шкалі часу ця задача і з'являється опис задачі кнопка ніби розширяється. В самому верху є кнопка видалити всі задачі цього дня/тижня/місяця. 

// Футер:
// Посилання на мене в лінкедін, джині, вокрюа, гітхаб. Зміна кольору сайту.
// Копірайт